FreeBSD/thinjails.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />

#+begin_export html
<nav class="crumbs">
  <ol>
    <li class="crumb"><a href="../index.html">Home</a></li>
    <li class="crumb">Create jail clones from OpenZFS snapshots</li>
    <div class="lang">
    <li><a href="en/thinjails.html">en</a>&nbsp;</li>
    <li> | <a href="en/thinjails.html">it</a></li>
    </div>
  </ol>
</nav>
#+end_export


#+TITLE: Create jail clones from OpenZFS snapshots
#+OPTIONS: title:nil
#+AUTHOR: https://vieron.info
# Disable super/subscripting 
#+OPTIONS: ^:nil

#+OPTIONS: toc:nil

@@html:<h1 style="text-align: center;">@@Create jail clones from OpenZFS snapshots@@html:</h1>@@
@@html:<h3 style="text-align: center;">@@WARNING: the following are my personal notes. Use at your own risk!@@html:</h3>@@



* Creating a Thin Jail Using OpenZFS Snapshots

#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots</a></p>
#+end_export

Start all configured jails at system boot:
#+begin_example
# sysrc jail_enable="YES"
# sysrc jail_parallel_start="YES"
#+end_example


Create datasets for the jail directories:
#+begin_example
# zfs create -o mountpoint=/usr/local/jails zroot/jails
# zfs create zroot/jails/media
# zfs create zroot/jails/templates
# zfs create zroot/jails/containers
#+end_example

** Create template jail "ZFS snapshot"
Fetch and patch base, then create snapshot for future clones
#+begin_example
# fetch https://download.freebsd.org/ftp/releases/amd64/amd64/13.2-RELEASE/base.txz -o /usr/local/jails/media/13.2-RELEASE-base.txz
# tar -xf /usr/local/jails/media/13.2-RELEASE-base.txz -C /usr/local/jails/templates/13.2-RELEASE --unlink
# freebsd-update -b /usr/local/jails/templates/13.2-RELEASE/ fetch install
# zfs snapshot zroot/jails/templates/13.2-RELEASE@base
#+end_example

** Create new jail "ZFS clone" from template
Clone from snapshot
#+begin_example
# zfs clone zroot/jails/templates/13.2-RELEASE@base zroot/jails/containers/thinjail
#+end_example

Copy essential configuration files (OPTIONAL)
#+begin_example
# cp /etc/resolv.conf /usr/local/jails/containers/thinjail/etc/resolv.conf
# cp /etc/localtime /usr/local/jails/containers/thinjail/etc/localtime
#+end_example

Create a jail configuration file for the newly created jail in /etc/jail.conf.d:
#+begin_example
# ls /etc/jail.conf.d/
thinjail.conf
#+end_example

Start the jail:
#+begin_example
# service jail start thinjail
#+end_example

* Jail Upgrading

#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading</a></p>
#+end_export

Upgrade jail to latest patch release:
#+begin_example
# freebsd-update -j thinjail fetch install
# service jail restart thinjail
#+end_example

Upgrade jail to new major or minor release:

1. First upgrade and reboot Host

2. then upgrade jail:
#+begin_example
# freebsd-update -j thinjail -r 13.2-RELEASE upgrade
# freebsd-update -j thinjail install
# service jail restart thinjail
# freebsd-update -j thinjail install
# service jail restart thinjail
#+end_example

#+TOC: headlines N
