en/FreeBSD/thinjails.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-02 Fri 18:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Create jail clones from OpenZFS snapshots</title>
<meta name="author" content="https://vieron.info" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css" />
</head>
<body>
<div id="content" class="content">
<div class="lang">
<li><a href="thinjails.html">en</a>&nbsp;</li>
<li> | <a href="/it/FreeBSD/thinjails.html">it</a></li>
</div>

<nav class="crumbs">
  <ol>
    <li class="crumb"><a href="/index.html">Home</a></li>
    <li class="crumb">Create jail clones from OpenZFS snapshots</li>
  </ol>
</nav>


<p>
<h1 style="text-align: center;">Create jail clones from OpenZFS snapshots</h1>
<h3 style="text-align: center;">WARNING: the following are my personal notes. Use at your own risk!</h3>
</p>
<div id="outline-container-orgbe6defe" class="outline-2">
<h2 id="orgbe6defe"><span class="section-number-2">1.</span> Creating a Thin Jail Using OpenZFS Snapshots</h2>
<div class="outline-text-2" id="text-1">
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#creating-thin-jail-openzfs-snapshots</a></p>

<p>
Start all configured jails at system boot:
</p>
<pre class="example" id="orgd897f45">
# sysrc jail_enable="YES"
# sysrc jail_parallel_start="YES"
</pre>


<p>
Create datasets for the jail directories:
</p>
<pre class="example" id="orgac12c2c">
# zfs create -o mountpoint=/usr/local/jails zroot/jails
# zfs create zroot/jails/media
# zfs create zroot/jails/templates
# zfs create zroot/jails/containers
</pre>
</div>
<div id="outline-container-org1198f98" class="outline-3">
<h3 id="org1198f98"><span class="section-number-3">1.1.</span> Create template jail "ZFS snapshot"</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Fetch and patch base, then create snapshot for future clones
</p>
<pre class="example" id="org944e380">
# fetch https://download.freebsd.org/ftp/releases/amd64/amd64/13.2-RELEASE/base.txz -o /usr/local/jails/media/13.2-RELEASE-base.txz
# tar -xf /usr/local/jails/media/13.2-RELEASE-base.txz -C /usr/local/jails/templates/13.2-RELEASE --unlink
# freebsd-update -b /usr/local/jails/templates/13.2-RELEASE/ fetch install
# zfs snapshot zroot/jails/templates/13.2-RELEASE@base
</pre>
</div>
</div>
<div id="outline-container-orgcf95fac" class="outline-3">
<h3 id="orgcf95fac"><span class="section-number-3">1.2.</span> Create new jail "ZFS clone" from template</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Clone from snapshot
</p>
<pre class="example" id="org7312379">
# zfs clone zroot/jails/templates/13.2-RELEASE@base zroot/jails/containers/thinjail
</pre>

<p>
Copy essential configuration files (OPTIONAL)
</p>
<pre class="example" id="org33521be">
# cp /etc/resolv.conf /usr/local/jails/containers/thinjail/etc/resolv.conf
# cp /etc/localtime /usr/local/jails/containers/thinjail/etc/localtime
</pre>

<p>
Create a jail configuration file for the newly created jail in /etc/jail.conf.d:
</p>
<pre class="example" id="org6b64790">
# ls /etc/jail.conf.d/
thinjail.conf
</pre>

<p>
Start the jail:
</p>
<pre class="example" id="org3667e4c">
# service jail start thinjail
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc4ddb2" class="outline-2">
<h2 id="orgbc4ddb2"><span class="section-number-2">2.</span> Jail Upgrading</h2>
<div class="outline-text-2" id="text-2">
<p><a href="https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading" target="_blank">https://docs.freebsd.org/en/books/handbook/jails/#jail-upgrading</a></p>

<p>
Upgrade jail to latest patch release:
</p>
<pre class="example" id="org87641e2">
# freebsd-update -j thinjail fetch install
# service jail restart thinjail
</pre>

<p>
Upgrade jail to new major or minor release:
</p>

<ol class="org-ol">
<li>First upgrade and reboot Host</li>

<li>then upgrade jail:</li>
</ol>
<pre class="example" id="org19ee37f">
# freebsd-update -j thinjail -r 13.2-RELEASE upgrade
# freebsd-update -j thinjail install
# service jail restart thinjail
# freebsd-update -j thinjail install
# service jail restart thinjail
</pre>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbe6defe">1. Creating a Thin Jail Using OpenZFS Snapshots</a>
<ul>
<li><a href="#org1198f98">1.1. Create template jail "ZFS snapshot"</a></li>
<li><a href="#orgcf95fac">1.2. Create new jail "ZFS clone" from template</a></li>
</ul>
</li>
<li><a href="#orgbc4ddb2">2. Jail Upgrading</a></li>
</ul>
</div>
</div>

<hr>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://vieron.info">https://vieron.info</a></p>
<p class="date">Created: 2025-05-02 Fri 18:42</p>
</div>
</body>
</html>
